myapp/app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT * FROM `departments`

  def show
    @department = Department.find(params[:id])
---
SELECT * FROM `departments` WHERE (`departments`.`id` = 1)

  def create
    @department = Department.new(params[:department])

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES(E'Operation', '2010-03-23 07:45:28.622459', '2010-03-23 07:45:28.622459') RETURNING "id"