myapp/app/controllers/employees_controller.rb

SELECT * FROM `employees`
---
  def index
    @employees = Employee.all

SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
---
  def show
    @employee = Employee.find(params[:id])

SELECT * FROM `departments`
---
  def new
    @employee = Employee.new
    @departments = Department.all

SELECT * FROM "employees" WHERE ("employees"."id" = 1)
SELECT * FROM "departments"
---
  def edit
    @employee = Employee.find(params[:id])
    @departments = Department.all

INSERT INTO "employees" ("city", "created_at", "birthdate", "zipcode", "updated_at", "mgr_id", "street", "mobile", "user_id", "last_name", "phone", "first_name", "state", "department_id") VALUES(E'Mumbai', '2010-03-23 08:09:13.331158', '2005-03-23', E'400076', '2010-03-23 08:09:13.331158', NULL, E'C504', E'989898988', NULL, E'N', E'123144', E'Pradeep', E'MH', 3) RETURNING "id"
---
  def create
    @employee = Employee.new(params[:employee])
    @departments = Department.all
    respond_to do |format|
      if @employee.save