myapp/app/controllers/roles_controller.rb

SELECT * FROM "roles"
---
  def index
    @roles = Role.all