myapp/app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_name", "last_login_ip", "login", "last_login_at", "email", "first_name") VALUES(E'AChXFqz61odSqKBPny-i', '2010-03-16 10:43:16.249462', '2010-03-16 10:43:16.250415', E'6674043ee67ab493e3988075856318051d6b5ea283242236f1776a047b6f03051eb55212ac44c2845f5e24f1bf243496b250993ce3b95761a7858003912dc5b4', E'UhWyPC-10QsS4y4FW35E', '2010-03-16 10:43:16.250415', 0, E'127.0.0.1', E'a4HMfcbOyQ8pMp9AIhFI', '2010-03-16 10:43:16.208386', E'b474bf67a1595e2457ab7b7c451920c643e5981e147af95fbcf25b537dfbda57edb020441684eb16beed9220c82fcc4917c40b380915e7ca737ea53119f0f496', 1, E'rawal', NULL, E'hitesh', NULL, E'hi@abc.om', E'hitesh') RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    @employee = Employee.find(params[:employee][:id])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = E'2') LIMIT 1
---
  def show
    @user = User.find(params[:id])